# Вычислите 2^179. Выведите на экран вычисленное значение.
from math import pow
print(int(pow(2, 179)))